{
    "leftBar": {
        "age": "Age",
        "ageC": "years O.",
        "location": "Location",
        "phone": "Phone"
    },
    "MainLinks": {
        "home": "Home",
        "projects": "Projects",
        "about": "About Me",
        "blog": "blog"
    },
    "HomePage": {
        "title": "Hello, I'm Hector Contreras, though on the internet you'll find me as hikdul (but that's another story).",
        "text1": "I am a self-taught software developer with several years of experience creating digital solutions.",
        "text2": "My journey in programming began with formal studies at the University of Los Andes (Venezuela), where I completed five semesters of Systems Engineering. However, due to various circumstances, I did not finish the degree. Nevertheless, my passion for technology never stopped.",
        "text3": "Programming has always been more than just a job or a field of study for me; it is a hobby and a way to understand the world. I love creating scripts, small programs, and tools that simplify tasks or even simulate behaviors just out of curiosity.",
        "text4": "In 2020, just a month before the pandemic began, I had my first big break in the programming world. By a twist of fate, I landed a job developing a cloud-based project using what was then known as .NET Core (now .NET). From that moment, my career took a more professional path, and I have continued to explore and learn new technologies.",
        "about": "Go to the about page",
        "hikdul": "Hector Luis Contreras Di Girolamo",
        "dotnet0": "marked my entry into the professional world as a developer, so I have a special appreciation for them.",
        "dotnet1": "I mainly use this framework to develop backend services, taking advantage of its robustness, scalability, and the broad ecosystem that supports it. I also use it for frontend development through .NET’s MVC model, which allows me to build structured, clean, and maintainable applications.",
        "dotnet2": "I also use C# to create general-purpose utility scripts and to interact with various devices. Its versatility has allowed me to develop solutions in areas like IoT, as well as to connect with hardware such as the Raspberry Pi, among others. One of the things I enjoy most about working with C# is how intuitive it is to implement concurrent tasks and parallelism, which is especially useful in services that require recurring or simultaneous processes.",
        "dotnet3": "Together, .NET and C# form a solid and flexible foundation that allows me to tackle projects of various scales, from small tools to more complex systems.",
        "js0": "is a key piece of my tech stack, as I use it for both backend and frontend, adapting it to the needs of each project.",
        "js1": "I mainly work with",
        "js2": ", using frameworks such as",
        "js3": ", which provides me with a modular structure and advanced features from the start. I also use it to develop real-time applications that require",
        "js4": " or ",
        "js5": ", leveraging its ability to efficiently handle multiple concurrent connections.",
        "js6": "JavaScript is fundamental in my frontend development, where I use",
        "js7": "as one of my main tools. I also often work with frameworks like",
        "js8": ", which optimize performance and the development experience, making it easier to create fast and dynamic applications.",
        "js9": "I also develop scripts to automate processes, especially for web connectivity tasks or data manipulation. Whether to send and receive information from APIs or for small automations, JavaScript allows me to create lightweight and efficient solutions.",
        "js10": " and ",
        "js11": "Personally, I prefer working with",
        "js12": ", as its strict typing provides greater control over the code, making it easier to maintain and scale projects as they grow.",
        "py0": "is a language present in nearly every modern development environment, and it stands out for its simplicity, readability, and versatility.",
        "py1": "In my case, I mainly use it for",
        "py2": "and for creating scripts for processes that don't require a high level of complexity or strict control. Thanks to its flexible nature, it's ideal for quickly solving general tasks or prototyping functionalities.",
        "py3": "Additionally, I find Python to be an excellent tool for introducing new people to the world of programming. Its beginner-friendly learning curve allows you to focus on logic without being distracted by syntactic details, making early participation in real projects easier.",
        "py4": "For this reason, many of my services and solutions start out being developed in Python during their initial phase. However, as the projects mature and demand greater robustness, scalability, or control, I usually migrate them to more structured languages such as",
        "py5": " or ",
        "rpi0": "The possibility of having a",
        "rpi1": "like the Raspberry Pi, equipped with",
        "rpi2": "outputs, allows me to easily connect the physical world with the digital one. Its versatility makes it an ideal tool for developing custom solutions that interact directly with sensors, actuators, and other devices.",
        "rpi3": "I currently have several implementations running on these devices, and I continue exploring new use cases that integrate software and hardware efficiently.",
        "rpi4": "At the same time, I’m starting tests with",
        "rpi5": "aiming to replicate some of these functionalities with a more economical approach.",
        "rpi6": "While someone reads these lines, I'm probably already soldering pins or restarting firmware on one of these chips."
    },
    "trabajoYtecnologias": {
        "backend": "I specialize in developing services and applications that operate independently, managing database connections and executing concurrent tasks. This is the area where I currently have the most products in production.",
        "frontEnd": "For me, the frontend is the way to bring an application's logic to life. I focus on making user interaction intuitive and pleasant, ensuring that the experience reflects the effort put into every detail.",
        "cloud": "I primarily work with AWS, although I have occasionally deployed projects on platforms like Vercel or shared servers such as GoDaddy and Banana Hosting, among others.",
        "otros": "This is my exploration zone. Here, I include embedded systems, scripts designed for semi-autonomous tasks, IoT solutions, and even my own MQTT server, developed in Rust as an alternative to Mosquitto.",
        "asispass": "Software designed for tracking employee check-ins and attendance across various companies. It uses SOAP for communication and holds official certification for valid use issued by the government of the Republic of Chile.",
        "trendbas": "Landing page developed for a company in the industrial automation sector. Its goal is to serve as an appealing entry point for potential clients and to enhance their digital presence.",
        "rustquito": "MQTT broker developed in Rust, inspired by Mosquitto but with key structural differences. Intended for IoT environments, it offers greater control and customization over message flow."
    }
}