{
    "leftBar": {
        "age": "Eta",
        "ageC": "anni",
        "location": "Posizione",
        "phone": "Telefono"
    },
    "MainLinks": {
        "home": "Maggiore",
        "projects": "Progetti",
        "about": "Su Di Mi",
        "blog": "Dradi"
    },
    "HomePage": {
        "title": "Ciao, sono Hector Contreras, anche se su internet mi troverai come hikdul (ma questa è un'altra storia).",
        "text1": "Sono uno sviluppatore software autodidatta con diversi anni di esperienza nella creazione di soluzioni digitali.",
        "text2": "Il mio percorso nella programmazione è iniziato con studi formali presso l'Università delle Ande (Venezuela), dove ho completato cinque semestri di Ingegneria dei Sistemi. Tuttavia, a causa di varie circostanze, non ho terminato la laurea. Nonostante ciò, la mia passione per la tecnologia non si è mai fermata.",
        "text3": "La programmazione è sempre stata per me più di un semplice lavoro o di un campo di studio; è un passatempo e un modo per comprendere il mondo. Adoro creare script, piccoli programmi e strumenti che semplificano i compiti o addirittura simulano comportamenti, solo per curiosità.",
        "text4": "Nel 2020, appena un mese prima dell'inizio della pandemia, ho avuto la mia prima grande opportunità nel mondo della programmazione. Per un caso del destino, ho trovato un lavoro sviluppando un progetto basato sul cloud utilizzando quello che allora era conosciuto come .NET Core (ora .NET). Da quel momento, la mia carriera ha preso una direzione più professionale e ho continuato a esplorare e imparare nuove tecnologie.",
        "about": "Vai alla pagina chi siamo",
        "hikdul": "Hector Luis Contreras Di Girolamo",
        "dotnet0": "hanno segnato il mio ingresso nel mondo del lavoro come sviluppatore, quindi ho un affetto particolare per loro.",
        "dotnet1": "Utilizzo principalmente questo framework per sviluppare servizi backend, sfruttandone la solidità, la scalabilità e l'ampio ecosistema che lo supporta. Inoltre, lo uso anche per il frontend tramite il modello MVC di .NET, che mi consente di costruire applicazioni strutturate, pulite e facilmente manutenibili.",
        "dotnet2": "Uso anche C# per creare script di utilità generale e per interagire con diversi dispositivi. La sua versatilità mi ha permesso di sviluppare soluzioni in ambiti come l'IoT, oltre a stabilire connessioni con hardware come il Raspberry Pi, tra gli altri. Una delle cose che apprezzo di più nel lavorare con C# è quanto sia intuitivo implementare attività concorrenti e il parallelismo, particolarmente utile nei servizi che richiedono processi ricorrenti o simultanei.",
        "dotnet3": "Insieme, .NET e C# formano una base solida e flessibile che mi consente di affrontare progetti di varie dimensioni, da piccoli strumenti a sistemi più complessi.",
        "js0": "è un elemento chiave del mio stack tecnologico, poiché lo utilizzo sia per il backend che per il frontend, adattandolo alle esigenze di ogni progetto.",
        "js1": "Principalmente lavoro con",
        "js2": ", utilizzando framework come",
        "js3": ", che mi offre una struttura modulare e funzionalità avanzate fin dall'inizio. Lo utilizzo anche per sviluppare applicazioni in tempo reale che richiedono",
        "js4": " o ",
        "js5": ", sfruttando la sua capacità di gestire più connessioni concorrenti in modo efficiente.",
        "js6": "JavaScript è fondamentale per lo sviluppo frontend, dove utilizzo",
        "js7": "come uno dei miei principali strumenti. Inoltre, lavoro spesso con framework come",
        "js8": ", che ottimizzano le prestazioni e l'esperienza di sviluppo, facilitando la creazione di applicazioni rapide e dinamiche.",
        "js9": "Sviluppo anche script per automatizzare processi, in particolare per attività di connettività web o manipolazione dei dati. Che si tratti di inviare e ricevere informazioni da API o di piccole automazioni, JavaScript mi consente di creare soluzioni leggere ed efficienti.",
        "js10": " e ",
        "js11": "A livello personale, preferisco lavorare con",
        "js12": ", poiché il suo tipaggio rigoroso offre un maggiore controllo sul codice, facilitando la manutenzione e la scalabilità dei progetti man mano che crescono.",
        "py0": "è un linguaggio presente in quasi tutti gli ambienti di sviluppo moderni, e si distingue per la sua semplicità, leggibilità e versatilità.",
        "py1": "Nel mio caso, lo utilizzo principalmente per",
        "py2": "e per creare script per processi che non richiedono un alto livello di complessità o controllo rigoroso. Grazie alla sua natura flessibile, è ideale per risolvere rapidamente compiti generici o prototipare funzionalità.",
        "py3": "Inoltre, considero Python uno strumento eccellente per introdurre nuove persone al mondo della programmazione. La sua curva di apprendimento amichevole consente di concentrarsi sulla logica senza distrarsi con dettagli sintattici, facilitando la partecipazione precoce a progetti reali.",
        "py4": "Per questo motivo, molti dei miei servizi e soluzioni iniziano ad essere sviluppati in Python durante la fase iniziale. Tuttavia, man mano che i progetti maturano e richiedono maggiore robustezza, scalabilità o controllo, di solito li migro verso linguaggi più strutturati come",
        "py5": " o ",
        "rpi0": "La possibilità di avere un",
        "rpi1": "come il Raspberry Pi, dotato di uscite",
        "rpi2": ", mi consente di collegare facilmente il mondo fisico con quello digitale. La sua versatilità lo rende uno strumento ideale per sviluppare soluzioni personalizzate che interagiscono direttamente con sensori, attuatori e altri dispositivi.",
        "rpi3": "Attualmente ho diverse implementazioni che funzionano su questi dispositivi, e continuo a esplorare nuovi casi d'uso che integrano software e hardware in modo efficiente.",
        "rpi4": "Parallelamente, sto iniziando test con",
        "rpi5": "cercando di replicare parte di queste funzionalità con un approccio più economico.",
        "rpi6": "Mentre qualcuno legge queste righe, probabilmente sto già saldando pin o riavviando il firmware su uno di questi chip."
    },
    "trabajoYtecnologias": {
        "backend": "Mi specializzo nello sviluppo di servizi e applicazioni che funzionano in modo indipendente, gestendo connessioni con database ed eseguendo attività simultanee. Questa è l'area in cui attualmente ho più prodotti in produzione.",
        "frontEnd": "Per me, il frontend è il modo di dare vita alla logica di un'applicazione. Mi concentro nel rendere l'interazione dell'utente intuitiva e piacevole, assicurandomi che l'esperienza rifletta l'impegno posto in ogni dettaglio.",
        "cloud": "Lavoro principalmente con AWS, anche se occasionalmente ho distribuito progetti su piattaforme come Vercel o su server condivisi come GoDaddy e Banana Hosting, tra gli altri.",
        "otros": "Questa è la mia zona di esplorazione. Qui includo sistemi embedded, script progettati per attività semi-autonome, soluzioni per l'IoT e persino il mio server MQTT, sviluppato in Rust come alternativa a Mosquitto."
    }
}